In [1]:
import pandas as pd

1.tao Series

In [46]:
s = pd.Series([2,4,2,4])

In [47]:
s

0    2
1    4
2    2
3    4
dtype: int64

In [5]:
# truyen co index
d = pd.Series([3,5,2,5], index=["a","b","y","j"])

In [6]:
d

a    3
b    5
y    2
j    5
dtype: int64

In [11]:
#tao series tu dict
data = {'a':-1.2,'b':2.4,'c':3.5}
ser = pd.Series(data,index=['a','b','c','e'])
print(ser)

a   -1.2
b    2.4
c    3.5
e    NaN
dtype: float64

In [10]:
data = {'a' : -1.3, 'b' : 11.7, 'd' : 2.0, 'f': 10, 'g': 5}
ser = pd.Series(data,index=['a','c','b','d','e','f'])
print(ser)

a    -1.3
c     NaN
b    11.7
d     2.0
e     NaN
f    10.0
dtype: float64

In [14]:
#tao series tu scalar
e = pd.Series(5,index = [1,5,2,5,2])
print(e)

1    5
5    5
2    5
5    5
2    5
dtype: int64

In [3]:
#truy cap du lieu tu series voi index va vi tri
data1 = {'a' : -1.3, 'b' : 11.7, 'd' : 2.0, 'f': 10, 'g': 5}
ser = pd.Series(data1,index=['a','c','b','d','e','f'])
print(ser['b'])

11.7

In [4]:
print(ser[:'d'])

a    -1.3
c     NaN
b    11.7
d     2.0
dtype: float64

In [5]:
print(ser[-2:])

e     NaN
f    10.0
dtype: float64

2. DataFrame

In [8]:
#tao dict tu cac series
s = {'mot':pd.Series([1,3,2,5],index =['a','b','c','e'],dtype = int),
     'hai':pd.Series([1,5,2,4],index = ['f','t','d','q'],dtype = int)}
df = pd.DataFrame(s)
print(df)

   mot  hai
a  1.0  NaN
b  3.0  NaN
c  2.0  NaN
d  NaN  2.0
e  5.0  NaN
f  NaN  1.0
q  NaN  4.0
t  NaN  5.0

In [9]:
#cac thao tac chon,them ,xoa cot
s = {'một': pd.Series([1., 2., 3., 5.], index=['a', 'b', 'c', 'e']),
     'hai': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
     'ba': pd.Series([9., -1.3, 3.5, 41.1], index=['a', 'b', 'c', 'd'])}
df = pd.DataFrame(s)
#chon cot 2 
df_hai = df['hai']
print(df_hai)

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: hai, dtype: float64

In [19]:
#tao df tu dict cac series 2
t = {'một': pd.Series([1., 2., 3., 5.], index=['a', 'b', 'c', 'e']),
     'hai': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd'])}
dft = pd.DataFrame(t, index=['a','e'])
print(dft)

   một  hai
a  1.0  1.0
e  5.0  NaN

In [21]:
#chon cot
q = {'một': pd.Series([1., 2., 3., 5.], index=['a', 'b', 'c', 'e']),
     'hai': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
     'ba': pd.Series([9., -1.3, 3.5, 41.1], index=['a', 'b', 'c', 'd'])}
df3 = pd.DataFrame(q)
df_chon = df3['hai']
print(df_chon)

a    1.0
b    2.0
c    3.0
d    4.0
e    NaN
Name: hai, dtype: float64

In [22]:
# them cot
w = {'một': pd.Series([1., 2., 3., 5.], index=['a', 'b', 'c', 'e']),
     'hai': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
     'ba': pd.Series([9., -1.3, 3.5, 41.1], index=['a', 'b', 'c', 'd'])}
df4= pd.DataFrame(w)
# thêm cột bốn với giá trị mỗi ô theo công thức
df4['bốn'] = w['hai'] - w['ba']

# thêm cột với giá trị vô hướng (scalar value)
df4['Chuẩn'] = 'OK'

# thêm cột không cùng số lượng index với DataFrame
df4['Khác'] = df4['hai'][:3]

# thêm cột True/False theo điều kiện
df4['KT'] = df4['một'] == 3.0

# dùng hàm insert. Cột "chèn" bên dưới sẽ ở vị trí 2 (tính từ 0), có giá trị bằng cột một
df4.insert(2, 'chèn', df4['một'])

print(df)

   một  hai    ba
a  1.0  1.0   9.0
b  2.0  2.0  -1.3
c  3.0  3.0   3.5
d  NaN  4.0  41.1
e  5.0  NaN   NaN

In [23]:
#xoa cot del df['hai']

In [24]:
#chon dong theo label
s = {'một': pd.Series([1., 2., 3., 5.], index=['a', 'b', 'c', 'e']),
     'hai': pd.Series([1., 2., 3., 4.], index=['a', 'b', 'c', 'd']),
     'ba': pd.Series([9., -1.3, 3.5, 41.1], index=['a', 'b', 'c', 'd'])}

df = pd.DataFrame(s)
d = df.loc['a']

In [25]:
print(d)

một    1.0
hai    1.0
ba     9.0
Name: a, dtype: float64

In [26]:
#chon dong theo vi tri 
r = df.iloc[2]

In [28]:
print(r)

một    3.0
hai    3.0
ba     3.5
Name: c, dtype: float64

# getting and knowing data

In [2]:
import pandas as pd
import numpy as np

step 1

In [3]:
df = pd.read_csv('chipotle.csv', sep ="\t")

In [4]:
df.head(5)

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [6]:
df.shape

(4622, 5)

In [7]:
#thong tin tung cot
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 4622 entries, 0 to 4621
Data columns (total 5 columns):
 #   Column              Non-Null Count  Dtype
---  ------              --------------  -----
 0   order_id            4622 non-null   int64
 1   quantity            4622 non-null   int64
 2   item_name           4622 non-null   object
 3   choice_description  3376 non-null   object
 4   item_price          4622 non-null   object
dtypes: int64(2), object(3)
memory usage: 180.7+ KB

In [8]:
df.describe(include="all")

           order_id     quantity     item_name choice_description item_price
count   4622.000000  4622.000000          4622               3376       4622
unique          NaN          NaN            50               1043         78
top             NaN          NaN  Chicken Bowl        [Diet Coke]     $8.75
freq            NaN          NaN           726                134        730
mean     927.254868     1.075725           NaN                NaN        NaN
std      528.890796     0.410186           NaN                NaN        NaN
min        1.000000     1.000000           NaN                NaN        NaN
25%      477.250000     1.000000           NaN                NaN        NaN
50%      926.000000     1.000000           NaN                NaN        NaN
75%     1393.000000     1.000000           NaN                NaN        NaN
max     1834.000000    15.000000           NaN                NaN        NaN

In [17]:
df.index

RangeIndex(start=0, stop=4622, step=1)

In [9]:
df.mean()

order_id    927.254868
quantity      1.075725
dtype: float64

 loc vs iloc

In [10]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,$2.39
1,1,1,Izze,[Clementine],$3.39
2,1,1,Nantucket Nectar,[Apple],$3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

In [11]:
df.loc[(df.quantity==15) | (df.item_name == "Nantucket Nectar")]

,order_id,quantity,item_name,choice_description,item_price
2,1,1,Nantucket Nectar,[Apple],$3.39
22,11,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
105,46,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
173,77,1,Nantucket Nectar,[Apple],$3.39
205,91,1,Nantucket Nectar,[Peach Orange],$3.39
436,189,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78
925,381,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
1356,553,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
1585,641,1,Nantucket Nectar,[Peach Orange],$3.39
1626,656,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
1706,690,1,Nantucket Nectar,[Apple],$3.39
2162,872,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78
2381,947,1,Nantucket Nectar,[Apple],$3.39
2430,965,1,Nantucket Nectar,[Pomegranate Cherry],$3.39
2653,1053,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
2818,1118,1,Nantucket Nectar,[Apple],$3.39
2838,1128,1,Nantucket Nectar,[Peach Orange],$3.39
2853,1133,1,Nantucket Nectar,[Apple],$3.39
2949,1172,1,Nantucket Nectar,[Peach Orange],$3.39
3318,1330,1,Nantucket Nectar,[Peach Orange],$3.39
3368,1351,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
3570,1433,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
3598,1443,15,Chips and Fresh Tomato Salsa,NaN,$44.25
3845,1541,1,Nantucket Nectar,[Peach Orange],$3.39
4019,1609,1,Nantucket Nectar,[Pineapple Orange Banana],$3.39
4078,1632,1,Nantucket Nectar,[Peach Orange],$3.39

In [13]:
df.loc[(df.quantity==2)& (df.item_name == "Nantucket Nectar")]

,order_id,quantity,item_name,choice_description,item_price
601,247,2,Nantucket Nectar,[Pineapple Orange Banana],$6.78
2379,947,2,Nantucket Nectar,[Peach Orange],$6.78

In [14]:
df.loc[(df.quantity==2)& (df.item_name == "Nantucket Nectar"),['order_id','quantity','item_name']]

      order_id  quantity         item_name
601        247         2  Nantucket Nectar
2379       947         2  Nantucket Nectar

In [18]:
df.iloc[9]

order_id                                                              5
quantity                                                              1
item_name                                                 Steak Burrito
choice_description    [Fresh Tomato Salsa, [Rice, Black Beans, Pinto...
item_price                                                       $9.25
Name: 9, dtype: object

In [20]:
df.iloc[3:11]

,order_id,quantity,item_name,choice_description,item_price
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98
5,3,1,Chicken Bowl,"[Fresh Tomato Salsa (Mild), [Rice, Cheese, Sou...",$10.98
6,3,1,Side of Chips,NaN,$1.69
7,4,1,Steak Burrito,"[Tomatillo Red Chili Salsa, [Fajita Vegetables...",$11.75
8,4,1,Steak Soft Tacos,"[Tomatillo Green Chili Salsa, [Pinto Beans, Ch...",$9.25
9,5,1,Steak Burrito,"[Fresh Tomato Salsa, [Rice, Black Beans, Pinto...",$9.25
10,5,1,Chips and Guacamole,NaN,$4.45

In [29]:
x = df.iloc[3:5,:-1]

In [28]:
x

,quantity,item_name,choice_description,item_price
3,1,Chips and Tomatillo-Green Chili Salsa,NaN,$2.39
4,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",$16.98

data manipulation

In [30]:
df.item_price.dtype

dtype('O')

Apply() : ham giup doi kieu du lieu

In [40]:
df.item_price=df.item_price.apply(lambda x : float(x.replace('$','')))

In [41]:
df.head()

,order_id,quantity,item_name,choice_description,item_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39
1,1,1,Izze,[Clementine],3.39
2,1,1,Nantucket Nectar,[Apple],3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98

In [42]:
#tao mot column moi
df['total_price']= df["quantity"]*df['item_price']

In [43]:
df.head()

,order_id,quantity,item_name,choice_description,item_price,total_price
0,1,1,Chips and Fresh Tomato Salsa,NaN,2.39,2.39
1,1,1,Izze,[Clementine],3.39,3.39
2,1,1,Nantucket Nectar,[Apple],3.39,3.39
3,1,1,Chips and Tomatillo-Green Chili Salsa,NaN,2.39,2.39
4,2,2,Chicken Bowl,"[Tomatillo-Red Chili Salsa (Hot), [Black Beans...",16.98,33.96

how much was the revenue for the period in the dataset

In [44]:
revenue = df['total_price'].sum()

In [45]:
print(revenue)

39237.02

which was the most-odered item ?

In [53]:
#ham group by 
c = df.groupby('item_name')['quantity'].sum()
c.sort_values(ascending=False).head(5)

item_name
Chicken Bowl           761
Chicken Burrito        591
Chips and Guacamole    506
Steak Burrito          386
Canned Soft Drink      351
Name: quantity, dtype: int64

In [58]:
#unique value
df.item_name.value_counts().count()

50

In [59]:
df.item_name.nunique()

50

In [8]:
pd.read_csv('file csv/users_dataset_public.csv')

,identifierHash,type,country,language,socialNbFollowers,socialNbFollows,socialProductsLiked,productsListed,productsSold,productsPassRate,...,civilityTitle,hasAnyApp,hasAndroidApp,hasIosApp,hasProfilePicture,daysSinceLastLogin,seniority,seniorityAsMonths,seniorityAsYears,countryCode
0,-7279641312655250028,user,Etats-Unis,en,3,8,0,0,0,0.0,...,mrs,False,False,False,True,709,3205,106.83,8.9,us
1,-1456013578740053406,user,Allemagne,de,3,8,0,0,0,0.0,...,mrs,False,False,False,True,709,3205,106.83,8.9,de
2,9006282053848196165,user,Suède,en,3,8,0,0,0,0.0,...,mr,True,False,True,True,689,3205,106.83,8.9,se
3,-7154634866120535654,user,Turquie,en,3,8,0,0,0,0.0,...,mrs,False,False,False,True,709,3205,106.83,8.9,tr
4,2858299215060733023,user,France,en,3,8,0,0,0,0.0,...,mr,True,False,True,True,709,3205,106.83,8.9,fr
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
98908,-5324380437900495747,user,Etats-Unis,fr,3,8,0,0,0,0.0,...,mr,False,False,False,True,708,3204,106.80,8.9,us
98909,-5607668753771114442,user,France,fr,3,8,0,0,0,0.0,...,mr,True,False,True,True,695,3204,106.80,8.9,fr
98910,350630276238833248,user,Belgique,en,3,8,0,0,0,0.0,...,mr,True,True,False,True,520,3204,106.80,8.9,be
98911,2006580738726207028,user,Italie,it,3,8,0,0,0,0.0,...,mrs,False,False,False,True,267,3204,106.80,8.9,it
98912,-7621316584087253691,user,Guinée,fr,3,8,0,0,0,0.0,...,mr,True,False,True,True,561,3204,106.80,8.9,gn